InformationRegisters/Renault_НормализованныеКонтактыДляПоиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_НормализованныеКонтактыДляПоиска</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_Трафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Трафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыАктивностиТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Закрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_РабочийЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПервичныйПовторный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПервичныйПовторный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ЗначенияРеквизитовТрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ЗначенияРеквизитовТрафика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_РеквизитыТрафика</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеквизитТрафика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_РеквизитыТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_УпущенныйТрафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_УпущенныйТрафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныУпущенныхКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторКомментария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУпущения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ТипыУпущенияТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Скрыт</Name>
					<Comment>Блинков для однозначного определения Скрытого трафика</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ЗамечанияМенеджерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ЗамечанияМенеджерам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстЗамечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ЗадачиПоТрафику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ЗадачиПоТрафику</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийПриЗакрытии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВремяЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ТипыЗадачПоТрафику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ЗаменыМенеджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ЗаменыМенеджеров</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МенеджерЗаменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МенеджерЗаменен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/CRM_ПервичныйПовторный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_ПервичныйПовторный</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Повторный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/CRM_КлассификацияОтделов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_КлассификацияОтделов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтделПродажАвтомобилей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделСервиса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделПродажЗапасныхЧастей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделКорпоративныхПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделТрейдИн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделReception</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОФУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтделКузовногоРемонта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/CRM_ТипыУпущенияТрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_ТипыУпущенияТрафика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

HTTPServices/DMS_ext_traffic/Ext/Module.bsl
//--- для теста ---
Функция v1get(Запрос)
	//Ответ = Новый HTTPСервисОтвет(200);
	//Возврат Ответ;
	
	Возврат ОтветСервера(200, "GET выполнен успешно");
КонецФункции

// POST метод
Функция v1_SetTraffic(Запрос)
	
	СтруктураПараметров = ПолучитьСтруктуруИзJSON(Запрос);
	
	Ошибки = ПроверитьЗаполнение(СтруктураПараметров);
	
	Если Ошибки <> Неопределено Тогда
		Возврат ОтветСервера(Ошибки.Код, Ошибки.Текст);
	КонецЕсли; 
	
	ЗаписатьНовыйТрафик(СтруктураПараметров);
	
	Возврат ОтветСервера(200, "Трафик успешно загружен");
	
КонецФункции


#Область Служебные
Функция ПолучитьСтруктуруИзJSON(Запрос)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
	Структура = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат Структура;

КонецФункции

Функция ОтветСервера(КодОтвета, СтрокаОтвета="")
	
	Ответ = Новый HTTPСервисОтвет(КодОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
	
	Возврат Ответ;
	
КонецФункции	
#КонецОбласти  // Служебные


#Область ПроверкаЗаполненияСтруктуры

Функция ПроверитьЗаполнение(Структура)
	
	РеквизитыЗаполнены = Истина;
	МассивНеЗаполненных = Новый Массив;
	Ошибка = Новый Структура("Код, Текст");
	
	
	//--- 1. проверим наличие нужных полей в структуре ---
	#Область НаличиеПолей
	
	МассивПроверяемыхПолей = Новый Массив;
	МассивПроверяемыхПолей.Добавить("name");
	МассивПроверяемыхПолей.Добавить("phone");
	МассивПроверяемыхПолей.Добавить("callback");
	МассивПроверяемыхПолей.Добавить("sex");
	МассивПроверяемыхПолей.Добавить("primary");
	МассивПроверяемыхПолей.Добавить("department");
	МассивПроверяемыхПолей.Добавить("administrator");
	МассивПроверяемыхПолей.Добавить("source");
	МассивПроверяемыхПолей.Добавить("model");
	МассивПроверяемыхПолей.Добавить("manager");
	МассивПроверяемыхПолей.Добавить("comment");
	МассивПроверяемыхПолей.Добавить("claim");
	МассивПроверяемыхПолей.Добавить("remark");
	МассивПроверяемыхПолей.Добавить("missed");
	МассивПроверяемыхПолей.Добавить("missed_reason");
	МассивПроверяемыхПолей.Добавить("missed_text");
	МассивПроверяемыхПолей.Добавить("dealership");
	
	Для Каждого ПроверяемоеПоле Из МассивПроверяемыхПолей Цикл
		Если НЕ Структура.Свойство(ПроверяемоеПоле) Тогда
			РеквизитыЗаполнены = Ложь;
			МассивНеЗаполненных.Добавить(ПроверяемоеПоле);
		КонецЕсли; 
	КонецЦикла; 
	
	Если НЕ РеквизитыЗаполнены Тогда
		Текст = СтрСоединить(МассивНеЗаполненных, Символы.ПС);
		Ошибка.Текст = "В JSON-структуре отсутствуют поля:" + Символы.ПС + Текст;
		Ошибка.Код = 400;
		Возврат Ошибка;
	КонецЕсли; 
	
	#КонецОбласти	// НаличиеПолей
	
	
	//--- 2. дополним структуру нужными полями ---
	// перед проверкой заполняем всякие объектные значения из текста, типа поиска в справочнике по наименованию
	#Область ЗаполнимНужныеПоля
	
	//ДилерскийЦентр = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	ДилерскийЦентр = НайтиДилерскийЦентрПоBIR(Структура.dealership);
	ТипТрафика = Справочники.CRM_ТипТрафика.Звонок;
	
	Если НЕ ЗначениеЗаполнено(ДилерскийЦентр) Тогда
		Ошибка.Текст = "У пользователя 1С не установлен дилерский центр по умолчанию";
		Ошибка.Код = 500;
		Возврат Ошибка;
	КонецЕсли;
	
	Пол = Перечисления.ПолФизическихЛиц[Структура.sex];
	ПервичныйПовторный = ?(Структура.primary, Перечисления.CRM_ПервичныйПовторный.Первичный, Перечисления.CRM_ПервичныйПовторный.Повторный);
	ВОтделПродаж = Ложь;
	Отдел = НайтиОтделПоНаименованию(ДилерскийЦентр, Структура.department, ВОтделПродаж);
	Администратор = НайтиАдминистратораПоНаименованию(ДилерскийЦентр, Структура.administrator);
	ИсточникИнформации = НайтиИсточникИнформацииПоНаименованию(Структура.source);
	Модель = НайтиМодельПоНаименованию(Структура.model, Отдел, ДилерскийЦентр);
	Менеджер = НайтиМенеджераПоНаименованию(Отдел, Структура.manager);
	Клиент = НайтиКлиента(Структура.name, Структура.phone);
	
	ПричинаУпущенногоКлиента = Справочники.CRM_ПричиныУпущенныхКлиентов.НайтиПоНаименованию(Структура.missed_reason, Истина);
	Если ПричинаУпущенногоКлиента = Неопределено Тогда
		ПричинаУпущенногоКлиента = Справочники.CRM_ПричиныУпущенныхКлиентов.ПустаяСсылка();
	КонецЕсли;
	
	ЗаписьНаСервис = Ложь;
	Если ДилерскийЦентр.ИспользуетАвтосервис Тогда
		Если Отдел.КлассификацияRenault = Перечисления.CRM_КлассификацияОтделов.ОтделСервиса Тогда
			ЗаписьНаСервис = ИСТИНА;
		КонецЕсли;
	КонецЕсли;
	
	
	Структура.Вставить("ДилерскийЦентр", ДилерскийЦентр);
	Структура.Вставить("ФИО", Структура.name);
	Структура.Вставить("Телефон", Структура.phone);
	Структура.Вставить("Перезвонить", Структура.callback);
	Структура.Вставить("Пол", Пол);
	Структура.Вставить("ПервичныйПовторный", ПервичныйПовторный);
	Структура.Вставить("Отдел", Отдел);
	Структура.Вставить("ВОтделПродаж", ВОтделПродаж);
	Структура.Вставить("Администратор", Администратор);
	Структура.Вставить("ИсточникИнформации", ИсточникИнформации);
	Структура.Вставить("Модель", Модель);
	Структура.Вставить("Менеджер", Менеджер);
	Структура.Вставить("Комментарий", Структура.comment);
	Структура.Вставить("Жалоба", Структура.claim);
	Структура.Вставить("ЗамечаниеМенеджеру", Структура.remark);
	Структура.Вставить("Упущен", Структура.missed);
	Структура.Вставить("Упущен_Причина", ПричинаУпущенногоКлиента);
	Структура.Вставить("Упущен_ТекстПричины", Структура.missed_text);
	
	Структура.Вставить("ТипТрафика", ТипТрафика);
	Структура.Вставить("ЗаписьНаСервис", ЗаписьНаСервис);
	Структура.Вставить("Клиент", Клиент);
	
	#КонецОбласти  // ЗаполнимНужныеПоля
	
	
	//--- 3. проверим заполнение обязательных полей ---
	// список реквизитов для проверки взят из обработки.Renault_ARM_Администратор.формы.ФормаРегистрацииОбщая - функция "ПроверитьЗаполнениеРеквизитов"
	#Область ПроверкаПолей
	
	СписокПроверяемыхПолей = Новый СписокЗначений;
	СписокПроверяемыхПолей.Добавить("ФИО", "ФИО (name)");
	СписокПроверяемыхПолей.Добавить("Телефон", "Телефон (phone)");
	СписокПроверяемыхПолей.Добавить("Администратор", "Администратор (administrator)");
	
	Если Не Структура.missed Тогда
		СписокПроверяемыхПолей.Добавить("Пол", "Пол (sex)");
		//СписокПроверяемыхПолей.Добавить("ИсточникИнформации", "Источник информации (source)");
		//СписокПроверяемыхПолей.Добавить("Модель", "Модель (model)");
		СписокПроверяемыхПолей.Добавить("Отдел", "Отдел (department)");
		СписокПроверяемыхПолей.Добавить("ПервичныйПовторный", "Первичный/Повторный (primary)");
	Иначе	// трафик упущен
		Если Структура.missed_reason = "Прочее" Тогда	    //Блинков внес доп условие проерки DMSREN-341
			СписокПроверяемыхПолей.Добавить("Упущен_Причина", "Причины упущенного клиента (missed_reason)");
			СписокПроверяемыхПолей.Добавить("Упущен_ТекстПричины", "Текст причины упущенного клиента (missed_text)");
		Иначе
			СписокПроверяемыхПолей.Добавить("Упущен_Причина", "Причины упущенного клиента (missed_reason)");
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ЭлементПП Из СписокПроверяемыхПолей Цикл
		Если НЕ ЗначениеЗаполнено(Структура[ЭлементПП.Значение]) Тогда
			РеквизитыЗаполнены = Ложь;
			МассивНеЗаполненных.Добавить(ЭлементПП.Представление);
		КонецЕсли;  
	КонецЦикла; 
	
	Если Не РеквизитыЗаполнены Тогда
		Текст = СтрСоединить(МассивНеЗаполненных, Символы.ПС);
		Ошибка.Текст = "В JSON-структуре не заполнены (или неправильно заполнены) поля:" + Символы.ПС + Текст;
		Ошибка.Код = 400;
		Возврат Ошибка;
	КонецЕсли; 
	
	#КонецОбласти  // ПроверкаПолей
	
	
	//--- конец проверок ---
	
	Возврат Неопределено;
	
КонецФункции 

Функция НайтиОтделПоНаименованию(ДилерскийЦентр, НаименованиеОтдела, ВОтделПродаж)
	
	Результат = Справочники.CRM_Отделы.ПустаяСсылка();
	
	// процедуры использованы те же, что и в АРМ Администратора при ручной регистрации трафика
	
	// это если нажата кнопка "другой отдел"
	СписокОтделов = Renault_CRM.ПолучитьСписокПрочихОтделовЦентра(ДилерскийЦентр);
	// а это если "отдел продаж"
	ОтделАвтосалона = Renault_CRM.ПолучитьОтделАвтосалона(ДилерскийЦентр);
	// объединим
	СписокОтделов.Добавить(ОтделАвтосалона);
	
	Для Каждого ЭлементСписка Из СписокОтделов Цикл
		Отдел = ЭлементСписка.Значение;
		Если Отдел.Наименование = НаименованиеОтдела Тогда
			Результат = Отдел;
			ВОтделПродаж = (Отдел = ОтделАвтосалона);
			Прервать;
		КонецЕсли;  
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //  

Функция НайтиАдминистратораПоНаименованию(ДилерскийЦентр, ФИОсотрудника)
	
	Результат = Неопределено;
	
	// процедуры использованы те же, что и в АРМ Администратора при ручной регистрации трафика
	СписокСотрудников = Renault_CRM.ПолучитьСписокСотрудниковРесепшн(ДилерскийЦентр);
	
	Для Каждого ЭлементСписка Из СписокСотрудников Цикл
		Сотрудник = ЭлементСписка.Значение;
		Если Сотрудник.Наименование = ФИОсотрудника Тогда
			Результат = Сотрудник;
			Прервать;
		КонецЕсли;  
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции //  

Функция НайтиМенеджераПоНаименованию(Отдел, ФИОсотрудника)
	
	Результат = Неопределено;
	
	// процедуры использованы те же, что и в АРМ Администратора при ручной регистрации трафика
	СписокСотрудников = Renault_CRM.ПолучитьСписокСотрудниковПоОтделу(Отдел);
	
	Для Каждого ЭлементСписка Из СписокСотрудников Цикл
		Сотрудник = ЭлементСписка.Значение;
		Если Сотрудник.Наименование = ФИОсотрудника Тогда
			Результат = Сотрудник;
			Прервать;
		КонецЕсли;  
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции //  

Функция НайтиИсточникИнформацииПоНаименованию(НаименованиеИИ)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсточникиИнформации.Ссылка
	               |ИЗ
	               |	Справочник.CRM_ИсточникиИнформации КАК ИсточникиИнформации
	               |ГДЕ
	               |	ИсточникиИнформации.ПометкаУдаления = ЛОЖЬ
	               |	И ИсточникиИнформации.Наименование = &Наименование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИсточникиИнформации.Наименование";
	Запрос.УстановитьПараметр("Наименование", НаименованиеИИ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции //  

Функция НайтиМодельПоНаименованию(НаименованиеМодели, Отдел, ДилерскийЦентр)
	
	Результат = Неопределено;
	
	СписокМоделей = Справочники.CRM_Отделы.ПолучитьПервичныйИнтерес(Отдел);
	Если Не ЗначениеЗаполнено(СписокМоделей) Тогда
		СписокМоделей = Renault_CRM.ПолучитьПервичныйИнтерес(ДилерскийЦентр);
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокМоделей Цикл
		ПервичныйИнтерес = ЭлементСписка.Значение;
		Если ПервичныйИнтерес.Наименование = НаименованиеМодели Тогда
			Результат = ПервичныйИнтерес;
			Прервать;
		КонецЕсли;  
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции //  

Функция НайтиДилерскийЦентрПоBIR(BIR)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_ДилерскиеЦентры.Ссылка
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	|ГДЕ
	|	НЕ CRM_ДилерскиеЦентры.ПометкаУдаления
	|	И CRM_ДилерскиеЦентры.BIR = &BIR";
	Запрос.УстановитьПараметр("BIR", BIR);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции //  

Функция НайтиКлиента(ФИО, Телефон)
	
	Результат = Неопределено;
	
	Телефон = НормализоватьТелефон(Телефон);
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Renault_НормализованныеКонтактыДляПоиска.Объект КАК Контрагент
		|ИЗ
		|	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК Renault_НормализованныеКонтактыДляПоиска
		|ГДЕ
		|	(Renault_НормализованныеКонтактыДляПоиска.Объект ССЫЛКА Справочник.Контрагенты
		|			ИЛИ Renault_НормализованныеКонтактыДляПоиска.Объект ССЫЛКА Справочник.CRM_ПотенциальныеКонтрагенты)
		|	И Renault_НормализованныеКонтактыДляПоиска.Объект.Наименование = &Наименование
		|	И Renault_НормализованныеКонтактыДляПоиска.Данные = &Телефон";
		Запрос.УстановитьПараметр("Наименование", ФИО);
		Запрос.УстановитьПараметр("Телефон", Телефон);
		
		//|	И Renault_НормализованныеКонтактыДляПоиска.Объект.Наименование ПОДОБНО &Наименование
		//|	И Renault_НормализованныеКонтактыДляПоиска.Данные ПОДОБНО &Телефон";
		//Запрос.УстановитьПараметр("Наименование", "%"+СокрЛП(ФИО)+"%");
		//Запрос.УстановитьПараметр("Телефон", "%" + Телефон + "%");

		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Контрагент;
		КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции //  

Функция НормализоватьТелефон(Телефон)
	
	Фрагмент = СокрЛП(Телефон);
	
	Фрагмент = СтрЗаменить(Фрагмент, "+", "");
	Фрагмент = СтрЗаменить(Фрагмент, "-", "");
	Фрагмент = СтрЗаменить(Фрагмент, ".", "");
	Фрагмент = СтрЗаменить(Фрагмент, "*", "");
	Фрагмент = СтрЗаменить(Фрагмент, " ", "");
	Фрагмент = СтрЗаменить(Фрагмент, "(", "");
	Фрагмент = СтрЗаменить(Фрагмент, ")", "");
	
	Если Найти(Фрагмент, "7") = 1 ИЛИ Найти(Фрагмент, "8") = 1 Тогда
		Фрагмент = Прав(Фрагмент, СтрДлина(Фрагмент) - 1);
	КонецЕсли;
	
	Возврат Фрагмент;
	
КонецФункции //  

#КонецОбласти  // ПроверкаЗаполненияСтруктуры


#Область ЗаписьТрафика

Процедура ЗаписатьНовыйТрафик(Параметры)
	
	//--- инициализация переменных ---

	НомерТестДрайва = "";
	МенеджерЗамены = Неопределено;
	
	ЕстьТД = ЗначениеЗаполнено(НомерТестДрайва);
	ТрафикУпущен = СтрДлина(Параметры.Упущен_ТекстПричины) > 0 ИЛИ Параметры.Упущен_Причина <> Справочники.CRM_ПричиныУпущенныхКлиентов.ПустаяСсылка();
	ЕстьЗамечаниеМенеджеру = (СтрДлина(Параметры.ЗамечаниеМенеджеру) > 0);
	МенеджерЗаменен = ЗначениеЗаполнено(МенеджерЗамены);
	//ВОтделПродаж = (Отдел = ОтделАвтосалона);
	ВОтделПродаж = (Параметры.ВОтделПродаж);
	
	//СоздаемРЛ = Не ТрафикУпущен И не ЗаписьНаСервис;
	
	ДилерскийЦентр = Параметры.ДилерскийЦентр;
	Клиент = Параметры.Клиент;
	

	
	//--------------------------------------------------
	//--- фиксация трафика ---
	
	Если Параметры.ЗаписьНаСервис = Ложь Тогда
		
		Идентификатор = "";
		Если ЗначениеЗаполнено(Клиент) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Renault_РабочиеЛисты.IDK,
			|	Renault_РабочиеЛисты.IDТрафика,
			|	Renault_РабочиеЛисты.Сотрудник
			|ИЗ
			|	Документ.Renault_РабочийЛист КАК Renault_РабочиеЛисты
			|ГДЕ
			|	Renault_РабочиеЛисты.Клиент = &Клиент
			|	И Renault_РабочиеЛисты.ЛистЗакрыт = ЛОЖЬ";
			Запрос.УстановитьПараметр("Клиент", Клиент);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Идентификатор = Выборка.IDТрафика;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
		
		ЗаписьТрафик = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
		
		ЗаписьТрафик.Период = ТекущаяДата();
		Идентификатор = Новый УникальныйИдентификатор();
		ЗаписьТрафик.ТипТрафика = Параметры.ТипТрафика;
		ЗаписьТрафик.Идентификатор = Идентификатор;
		ЗаписьТрафик.Менеджер = Параметры.Менеджер;
		ЗаписьТрафик.Администратор = Параметры.Администратор;
		ЗаписьТрафик.Отдел = Параметры.Отдел;
		ЗаписьТрафик.Клиент = Клиент;
		ЗаписьТрафик.ДилерскийЦентр = ДилерскийЦентр;
		ЗаписьТрафик.ПервичныйИнтерес = Параметры.Модель;
		ЗаписьТрафик.ИсточникИнформации = Параметры.ИсточникИнформации;
		ЗаписьТрафик.ПервичныйПовторный = Параметры.ПервичныйПовторный;
		ЗаписьТрафик.Представление = Параметры.ФИО;
		//ЗаписьТрафик.Обработан = ТрафикУпущен ИЛИ ЕстьТД;
		ЗаписьТрафик.Обработан = ТрафикУпущен;
		ЗаписьТрафик.Комментарий = Параметры.Комментарий;
		
		ЗаписьТрафик.Записать();
		
	КонецЕсли;
	
	//Создадим типизированные колонки в ТЗ
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ЗначенияРеквизитовТрафика.РеквизитТрафика КАК РеквизитТрафика,
	                      |	CRM_ЗначенияРеквизитовТрафика.ЗначениеРеквизита КАК ЗначениеРеквизита,
	                      |	CRM_ЗначенияРеквизитовТрафика.ИдентификаторТрафика
	                      |ИЗ
	                      |	РегистрСведений.CRM_ЗначенияРеквизитовТрафика КАК CRM_ЗначенияРеквизитовТрафика
	                      |ГДЕ
	                      |	CRM_ЗначенияРеквизитовТрафика.ИдентификаторТрафика ЕСТЬ NULL ");
	РеквизитыТрафика = Запрос.Выполнить().Выгрузить();
	//Удалим "лишние записи" на всякий случай
	РеквизитыТрафика.Очистить();
	
	//Заполним реквизиты трафика
	
	//Пол
	НовоеСвойство = РеквизитыТрафика.Добавить();
	НовоеСвойство.ИдентификаторТрафика = Идентификатор;
	НовоеСвойство.РеквизитТрафика = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.Пол;
	НовоеСвойство.ЗначениеРеквизита = Параметры.Пол;
	
	Если Параметры.ТипТрафика = Справочники.CRM_ТипТрафика.EmailДилера Тогда
		//email
		//НовоеСвойство = РеквизитыТрафика.Добавить();
		//НовоеСвойство.ИдентификаторТрафика = Идентификатор;
		//НовоеСвойство.РеквизитТрафика = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.Email;
		//НовоеСвойство.ЗначениеРеквизита = Телефон;
	Иначе
		// телефон
		НовоеСвойство = РеквизитыТрафика.Добавить();
		НовоеСвойство.ИдентификаторТрафика = Идентификатор;
		НовоеСвойство.РеквизитТрафика = ПланыВидовХарактеристик.CRM_РеквизитыТрафика.Телефон;
		НовоеСвойство.ЗначениеРеквизита = Параметры.Телефон;
	КонецЕсли;
	
	//Запись в регистр
	НЗ = РегистрыСведений.CRM_ЗначенияРеквизитовТрафика.СоздатьНаборЗаписей();
	НЗ.Отбор.ИдентификаторТрафика.Установить(Идентификатор);
	НЗ.Прочитать();
	НЗ.Загрузить(РеквизитыТрафика);
	Нз.Записать();
	
	
	//--------------------------------------------------
	//--- Фиксация упущенного трафика ---

	Если ТрафикУпущен Тогда
		Запись = РегистрыСведений.CRM_УпущенныйТрафик.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.ИдентификаторТрафика = Идентификатор;
		Запись.Менеджер = Параметры.Менеджер;
		Запись.ДилерскийЦентр = ДилерскийЦентр;
		Запись.Комментарий = СокрЛП(Параметры.Упущен_ТекстПричины);
		Запись.Причина = Параметры.Упущен_Причина;
		Запись.АвторКомментария = Параметры.Администратор;
		Запись.ВидУпущения = Перечисления.CRM_ТипыУпущенияТрафика.Менеджер;
		Запись.Записать();
	КонецЕсли;
	
	
	//--------------------------------------------------
	//--- Фиксация замечания менеджеру ---
	
	Если ЕстьЗамечаниеМенеджеру Тогда
		Запись = РегистрыСведений.CRM_ЗамечанияМенеджерам.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.ИдентификаторТрафика = Идентификатор;
		Запись.Менеджер = Параметры.Менеджер;
		Запись.ТекстЗамечания = СокрЛП(Параметры.ЗамечаниеМенеджеру);
		Запись.Записать();
	КонецЕсли;
	
	
	//--------------------------------------------------
	//--- Фиксация задачи по трафику ---
	
	Если Параметры.Перезвонить Тогда
		Запись = РегистрыСведений.CRM_ЗадачиПоТрафику.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.ИдентификаторТрафика = Идентификатор;
		Запись.ИдентификаторЗадачи = Новый УникальныйИдентификатор;
		Запись.ТипЗадачи = Перечисления.CRM_ТипыЗадачПоТрафику.ПерезвонПоПросьбеКлиента;
		Запись.Менеджер = Параметры.Менеджер;
		Запись.Автор = Параметры.Администратор;
		Запись.Комментарий = СокрЛП(Параметры.Комментарий);
		Запись.Телефон = Параметры.Телефон;
		Запись.Представление = Параметры.ФИО;
		Запись.Обработано = Ложь;
		Запись.Записать();
	КонецЕсли;
	
	
	//--------------------------------------------------
	//--- Фиксация замены менеджера ---
	
	Если МенеджерЗаменен Тогда
		Запись = РегистрыСведений.CRM_ЗаменыМенеджеров.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.ИдентификаторТрафика = Идентификатор;
		Запись.МенеджерЗаменил = Параметры.Менеджер;
		Запись.МенеджерЗаменен = МенеджерЗамены;
		Запись.Записать();
	КонецЕсли;
	
	
	//--------------------------------------------------
	//--- Создание рабочего листа и ТД ---
	
	Если ЕстьТД Тогда
		
		ЗаписьРЛ = Renault_CRM.СоздатьРабочийЛистПоТрафику(ЗаписьТрафик.Идентификатор);
		Если ЗаписьРЛ <> Неопределено Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	CRM_ЗаписьНаТестДрайв.Ссылка
			               |ИЗ
			               |	Документ.CRM_ЗаписьНаТестДрайв КАК CRM_ЗаписьНаТестДрайв
			               |ГДЕ
			               |	CRM_ЗаписьНаТестДрайв.РабочийЛист = &РабочийЛист
			               |	И CRM_ЗаписьНаТестДрайв.Проведен = ИСТИНА";
			Запрос.УстановитьПараметр("РабочийЛист", НомерТестДрайва);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Об = Выборка.Ссылка.ПолучитьОбъект();
				Об.РабочийЛист = ЗаписьРЛ.IDK;
				Об.Клиент = ЗаписьРЛ.Клиент;
				Об.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	//--------------------------------------------------
	//--- Создание обращения в автосервис ---
	
	Если Параметры.ЗаписьНаСервис и Не ТрафикУпущен Тогда
		
		Документ = Документы.Renault_CRM_ОбращениеВАвтоСервис.СоздатьДокумент();
		
		Документ.Дата = ТекущаяДата();
		Документ.ВидОбращения = Справочники.Renault_ВидыОбращенийВАвтосервис.СРешепшен;
		Документ.ДилерскийЦентр = ДилерскийЦентр;
		
		//от Вити
		//Документ.Менеджер = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", Сотрудник);
		Документ.Менеджер = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", Параметры.Администратор);
		//the-end
		
		Если ТипЗнч(Клиент) = Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты") ИЛИ
			ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			Документ.Клиент = Клиент;
		Иначе
			Документ.Клиент = Параметры.ФИО;
		КонецЕсли;
		
		Документ.Примечание = Параметры.Комментарий + " Модель: " + Параметры.Модель.Наименование;
		Документ.ПервичныйПовторный = Параметры.ПервичныйПовторный;
		Документ.ОбращениеОбработано = Ложь;
		
		Попытка
			Документ.ИдентификаторТрафика = Идентификатор;
		Исключение
		Конецпопытки;
			
		Документ.Жалоба = Параметры.Жалоба;
		
		Попытка
			Документ.ТелефонПримечание = Параметры.Телефон;
		Исключение
			Документ.Примечание = Документ.Примечание + " Телефон клиента: " + Параметры.Телефон;
		КонецПопытки;
		
		Документ.Записать();
		
		
		Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
		
		Напоминание.Отправитель = Параметры.Администратор;
		Напоминание.Подробнее = Документ.Ссылка;
		Напоминание.Адресаты.Добавить().Сотрудник = Параметры.Менеджер;
		ДатаОтправки = ТекущаяДата();
		Напоминание.ДатаОтправки = ДатаОтправки;
		Напоминание.Комментарий = Параметры.Комментарий;
		Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера;
		Напоминание.ПоказыватьС = ДатаОтправки;
		Напоминание.ПоказыватьПо = ДатаОтправки;
		Напоминание.Наименование = Параметры.ФИО;
		Напоминание.Сообщение = "На вас назначен клиент: " + Параметры.ФИО + " | " + Параметры.Комментарий + " | " + Параметры.Модель.Наименование;;
		
		Напоминание.Записать();
		
	КонецЕсли;
	
	//Если ЗаписьНаСервис и Жалоба Тогда
	//	
	//	Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
	//	Напоминание.Отправитель = Администратор;
	//	
	//	Запрос = Новый Запрос();
	//	Запрос.Текст = "ВЫБРАТЬ
	//				   |	Пользователи.Ссылка КАК Сотрудник
	//				   |ИЗ
	//				   |	Справочник.Пользователи КАК Пользователи
	//				   |ГДЕ
	//				   |	Пользователи.Сотрудник.Должность.Ссылка = &Ссылка
	//				   |	И Пользователи.Сотрудник.Подразделение В(&Подразделения)";
	//				   
	//	Запрос.УстановитьПараметр("Ссылка", Справочники.Должности.Мастер);
	//	Запрос.УстановитьПараметр("Подразделения", Отдел.Подразделения.ВыгрузитьКолонку("Подразделение"));
	//	ВыборкаАдресаты = Запрос.Выполнить().Выбрать();
	//	Пока ВыборкаАдресаты.Следующий() Цикл
	//		НоваяСтрока = Напоминание.Адресаты.Добавить();
	//		НоваяСтрока.Сотрудник = ВыборкаАдресаты.Сотрудник;
	//	КонецЦикла;
	//	
	//	ДатаОтправки = ТекущаяДата();
	//	Напоминание.ДатаОтправки = ДатаОтправки;
	//	Напоминание.Комментарий = Комментарий;
	//	Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.НовыйКлиентБезМенеджера;
	//	Напоминание.ПоказыватьС = ДатаОтправки;
	//	Напоминание.ПоказыватьПо = ДатаОтправки;
	//	Напоминание.Наименование = ФИО;
	//	Напоминание.Сообщение = "На вас назначен клиент: " + ФИО + " | " + Комментарий + " | " + Модель.Наименование;;
	//	
	//	Напоминание.Записать();
	//	
	//КонецЕсли;
	
	
	//--------------------------------------------------
	//--- временно ---   // ?? не знаю, что это "временно" значит, код взят из "АРМ Администратор (планшет)"
	
	//--------------------------------------------------
	//--- Дилерский код ---
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Отдел", Параметры.Отдел);
	СтруктураДанных.Вставить("ДилерскийЦентр", ДилерскийЦентр);
	СтруктураДанных.Вставить("ПервичныйПовторный", Параметры.ПервичныйПовторный);
	СтруктураДанных.Вставить("Модель", Параметры.Модель);
	СтруктураДанных.Вставить("ИсточникИнформации", Параметры.ИсточникИнформации);
	СтруктураДанных.Вставить("Комментарий", Параметры.Комментарий);
	СтруктураДанных.Вставить("Сотрудник", Параметры.Менеджер);
	СтруктураДанных.Вставить("Телефон", Параметры.Телефон);
	СтруктураДанных.Вставить("Администратор", Параметры.Администратор);
	СтруктураДанных.Вставить("ФИО", Параметры.ФИО);
	СтруктураДанных.Вставить("ТипТрафика", Параметры.ТипТрафика);
	СтруктураДанных.Вставить("Перезвонить", Параметры.Перезвонить);
	СтруктураДанных.Вставить("ТрафикУпущен",ТрафикУпущен);
	Renault_МодульДилера.ПриСозданииТрафика(СтруктураДанных);
	
	
	//--------------------------------------------------
	//--- Внесем в планшет продавца запись о клиенте ---
	
	Если ЗначениеЗаполнено(ДилерскийЦентр) И Параметры.ВОтделПродаж И Параметры.ТипТрафика = Справочники.CRM_ТипТрафика.ПосещениеАвтосалона Тогда
		Если Параметры.ДилерскийЦентр.СинхронизированСПланшетомПродавца = Истина Тогда
			КлиентскиеДанные = Новый Структура;
			Если ЗначениеЗаполнено(Клиент) Тогда
				КлиентскиеДанные.Вставить("Идентификатор", Строка(Клиент.УникальныйИдентификатор()));
				КлиентскиеДанные.Вставить("Имя", Клиент.Имя);
				КлиентскиеДанные.Вставить("Фамилия", Клиент.Фамилия);
				КлиентскиеДанные.Вставить("Отчество", Клиент.Отчество);
				КлиентскиеДанные.Вставить("Телефон", Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Клиент));
				КлиентскиеДанные.Вставить("Email", Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойEmailКлиента(Клиент));
				КлиентскиеДанные.Вставить("ДатаРождения", Клиент.ДатаРождения);
			Иначе
				Если ЗаписьТрафик <> Неопределено Тогда
					КлиентскиеДанные.Вставить("Идентификатор", ЗаписьТрафик.Идентификатор);
					КлиентскиеДанные.Вставить("Имя", Параметры.ФИО);
					КлиентскиеДанные.Вставить("Фамилия", "");
					КлиентскиеДанные.Вставить("Отчество", "");
					КлиентскиеДанные.Вставить("Телефон", Параметры.Телефон);
					КлиентскиеДанные.Вставить("Email", "");
					КлиентскиеДанные.Вставить("ДатаРождения", '00010101');
				КонецЕсли;
			КонецЕсли;
			Если КлиентскиеДанные.Свойство("Идентификатор") Тогда
				мПараметры = Новый Массив;
				мПараметры.Добавить(ДилерскийЦентр);
				мПараметры.Добавить(КлиентскиеДанные);
				мПараметры.Добавить(ТекущаяДата());
				мПараметры.Добавить(Ложь);
				мПараметры.Добавить(Неопределено);
				
				Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
					мПараметры.Добавить(Клиент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да);
				Иначе
					мПараметры.Добавить(Ложь);
				КонецЕсли;
				
				//ФоновыеЗадания.Выполнить("Renault_РаботаСSalesTablet.ОбновитьДанныеПоТрафику", мПараметры);
				// внесем в трафик отметку о синхронизации с планшетом продавца
				Если ЗначениеЗаполнено(Идентификатор) Тогда
					ЗаписьТрафика = Renault_CRM.ПолучитьЗаписьТрафикаПоID(Строка(Идентификатор));
					ЗаписьТрафика.Представление = ЗаписьТрафика.Представление;
					ЗаписьТрафика.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти  // ЗаписьТрафика
